{
  "sku": "book_12",
  "name": "The Inquisitor's Tale: Or, The Three Magical Children and Their Holy Dog",
  "author": "Adam Gidwitz",
  "description": "The Inquisitor's Tale is one of the most celebrated children's books of the year! ★ New York Times Bestseller ★ A New York Times Editor’s Choice ★ A New York Times Notable Children’s Book ★ A People Magazine Kid Pick ★ A Washington Post Best Children’s Book ★ A Wall Street Journal Best Children's Book ★ An Entertainment Weekly Best Middle Grade Book ★ A Booklist Best Book ★ A Horn Book Fanfare Best Book ★ A Kirkus Reviews Best Book ★ A Publishers Weekly Best Book ★ A School Library Journal Best Book ★ An ALA Notable Children's Book \"A profound and ambitious tour de force. Gidwitz is a masterful storyteller.\" —Matt de la Peña, Newbery Medalist and New York Times bestselling author \"What Gidwitz accomplishes here is staggering.\" —New York Times Book Review Includes a detailed historical note and bibliography On a dark night, travelers from across France cross paths at an inn and begin to tell stories of three children. Their adventures take them on a chase through France: they are taken captive by knights, sit alongside a king, and save the land from a farting dragon. On the run to escape prejudice and persecution and save precious and holy texts from being burned, their quest drives them forward to a final showdown at Mont Saint-Michel, where all will come to question if these children can perform the miracles of saints. Join William, an oblate on a mission from his monastery; Jacob, a Jewish boy who has fled his burning village; and Jeanne, a peasant girl who hides her prophetic visions. They are accompanied by Jeanne's loyal greyhound, Gwenforte . . . recently brought back from the dead. Told in multiple voices, in a style reminiscent of The Canterbury Tales, our narrator collects their stories and the saga of these three unlikely allies begins to come together. Beloved bestselling author Adam Gidwitz makes his long awaited return with his first new world since his hilarious and critically acclaimed Grimm series. Featuring manuscript illuminations throughout by illustrator Hatem Aly and filled with Adam’s trademark style and humor, The Inquisitor's Tale is bold storytelling that’s richly researched and adventure-packed.",
  "price": "$10.97"
}
